
| Steps                         | Status                     |
| ----------------------------- | -------------------------- |
| 🖌 Terraform Format and Style | `success` |
| ⚙️ Terraform Initialization   | `success` |
| 📖 Terraform Plan             | `success` |

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jujulego/lucifer/runs/run-Qv6d7eURoRGceAqV

Waiting for the plan to start...

Terraform v0.14.2
Configuring remote state backend...
Initializing Terraform configuration...
heroku_pipeline.lucifer-api: Refreshing state... [id=33cc2bf2-fdfd-4669-85e8-9aa3df887d32]
heroku_pipeline.lucifer-front: Refreshing state... [id=379096c8-1a67-4e55-8651-607df1a55e28]
auth0_tenant.tenant: Refreshing state... [id=terraform-20210216105503224100000001]
auth0_user.e2e: Refreshing state... [id=auth0|602ba487d8ace4007007f9f1]
auth0_resource_server.lucifer-api: Refreshing state... [id=602ba487f2aefa0041beebbb]
auth0_rule.rule["rules/blacklist-e2e-users.js"]: Refreshing state... [id=rul_JxLFHJ5CEfYBsyjt]
auth0_rule.rule["rules/add-roles.js"]: Refreshing state... [id=rul_waPU5KsSsN71nauk]
auth0_client.lucifer-e2e: Refreshing state... [id=YUeGPy87fAGlwDVkZ96cHHUBSJZiQA5G]
auth0_client.lucifer-api: Refreshing state... [id=Ni7eCeRfTINTJeDBlXyxtavguBCQR6iH]
auth0_role.reader: Refreshing state... [id=rol_SMo4iUNSlm3hfoTT]
auth0_role.admin: Refreshing state... [id=rol_QTI6wltBzuo9Z5d1]
heroku_app.lucifer-api: Refreshing state... [id=lucifer-api]
auth0_client_grant.lucifer-api--management-api: Refreshing state... [id=cgr_QyHaQMLvJBqCwlkF]
heroku_pipeline_config_var.lucifer-api-config: Refreshing state... [id=33cc2bf2-fdfd-4669-85e8-9aa3df887d32:review]
auth0_rule_config.e2e-client: Refreshing state... [id=E2E_CLIENT]
heroku_pipeline_coupling.lucifer-api-production: Refreshing state... [id=7af29f2a-5553-4db9-aedc-0316412ebbe4]
heroku_addon.lucifer-api: Refreshing state... [id=db97a959-f840-42e1-b6a7-f9051dd631c3]
heroku_pipeline_config_var.lucifer-front-config: Refreshing state... [id=379096c8-1a67-4e55-8651-607df1a55e28:review]
heroku_app.lucifer-front: Refreshing state... [id=lucifer-front]
auth0_client.lucifer-front: Refreshing state... [id=5JljofyvHLKItBSYbeQmR3xh82zaAIgF]
heroku_pipeline_coupling.lucifer-front-production: Refreshing state... [id=3f50936c-1b8e-4a9e-b7d3-d215db4ac579]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # auth0_client.lucifer-cli will be created
  + resource "auth0_client" "lucifer-cli" {
      + app_type                            = "native"
      + client_id                           = (known after apply)
      + client_secret                       = (sensitive value)
      + custom_login_page_on                = (known after apply)
      + grant_types                         = [
          + "device_code",
          + "refresh_token",
        ]
      + id                                  = (known after apply)
      + is_first_party                      = (known after apply)
      + is_token_endpoint_ip_header_trusted = (known after apply)
      + name                                = "Lucifer CLI"
      + oidc_conformant                     = true
      + token_endpoint_auth_method          = (known after apply)

      + jwt_configuration {
          + alg                 = "RS256"
          + lifetime_in_seconds = (known after apply)
          + secret_encoded      = (known after apply)
        }

      + refresh_token {
          + expiration_type              = (known after apply)
          + idle_token_lifetime          = (known after apply)
          + infinite_idle_token_lifetime = (known after apply)
          + infinite_token_lifetime      = (known after apply)
          + leeway                       = (known after apply)
          + rotation_type                = (known after apply)
          + token_lifetime               = (known after apply)
        }
    }

  # auth0_client.lucifer-e2e will be updated in-place
  ~ resource "auth0_client" "lucifer-e2e" {
        id                                  = "YUeGPy87fAGlwDVkZ96cHHUBSJZiQA5G"
        name                                = "Lucifer E2E"
      ~ oidc_conformant                     = false -> true
        # (16 unchanged attributes hidden)

      ~ jwt_configuration {
          + alg                 = "RS256"
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # auth0_resource_server.lucifer-api will be updated in-place
  ~ resource "auth0_resource_server" "lucifer-api" {
      ~ allow_offline_access                            = false -> true
        id                                              = "602ba487f2aefa0041beebbb"
        name                                            = "Lucifer API"
        # (8 unchanged attributes hidden)

        # (12 unchanged blocks hidden)
    }

  # heroku_app.lucifer-api will be updated in-place
  ~ resource "heroku_app" "lucifer-api" {
      ~ buildpacks            = [
          - "https://buildpack-registry.s3.amazonaws.com/buildpacks/heroku-community/multi-procfile.tgz",
          + "heroku-community/multi-procfile",
            "heroku/nodejs",
        ]
        id                    = "lucifer-api"
        name                  = "lucifer-api"
        # (11 unchanged attributes hidden)
    }

  # heroku_app.lucifer-front will be updated in-place
  ~ resource "heroku_app" "lucifer-front" {
      ~ buildpacks            = [
          - "https://buildpack-registry.s3.amazonaws.com/buildpacks/heroku-community/multi-procfile.tgz",
          + "heroku-community/multi-procfile",
            "heroku/nodejs",
          - "https://buildpack-registry.s3.amazonaws.com/buildpacks/heroku-community/static.tgz",
          + "heroku-community/static",
        ]
        id                    = "lucifer-front"
        name                  = "lucifer-front"
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 0 to destroy.

```

</details>

*Pusher: @Jujulego, Action: `pull_request`*